src/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-04-27 Thu 07:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>ITWS2 Final Exam, Spring 2017 IIIT Hyderabad</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="ITWS2 Instructors VLEAD" />
<link rel="stylesheet" type="text/css" href="./style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="./style/css/override.css" />
<link rel="icon" type="image/png" href="./style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="./index.html"> HOME </a>
</div><div id="content">
<h1 class="title">ITWS2 Final Exam, Spring 2017 IIIT Hyderabad</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. First things first</a></li>
<li><a href="#orgheadline2">2. What to do next</a></li>
<li><a href="#orgheadline3">3. Good Luck!</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> First things first</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Questions are allowed only about the initial build.</li>

<li>No questions will be entertained after the 10am.  Please
proceed after making reasonable assumptions after that.</li>

<li><p>
Literate code is under <a href="./runtime">./runtime</a>.  Built code is under
<a href="../build/code">../build/code</a> and documentation under <a href="../build/docs">../build/docs</a>.
</p>

<p>
You are expected to conform strictly to the above
structure.  If you need to create any new directories,
please make sure they are in the tree under <a href="./runtime">./runtime</a>.
If you fail to do so (e.g., create a new directory under
<code>src</code>), you may incur major penalties.
</p></li>
</ol>


<ol class="org-ol">
<li>Please sit ONLY at the seat assigned to you by your
TA's.</li>
</ol>


<ol class="org-ol">
<li>Fill in the org file <a href="./student-info.html">./student-info.html</a>.  Do this now
Please clearly mention your seat number.</li>
</ol>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> What to do next</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Locate your exam problem sheet based on whether you are
in the group A or B</li>
</ol>


<p>
Your group determines the problem set you will need to
attempt.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Seat No</th>
<th scope="col" class="org-left">Group</th>
<th scope="col" class="org-left">Problem Set</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Even</td>
<td class="org-left">A</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Odd</td>
<td class="org-left">B</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<ol class="org-ol">
<li>Read the high level description of the application at
<a href="./app.html">./app.html</a>.</li>

<li>Study the literate code implementing the application
that is a much smaller version of the user directory
application.  The starting point of the system's
documentation is the <a href="./runtime/index.html">runtime</a>.  Don't spend too much time
just reading, you can always come back to reading the
code.</li>

<li>Reach for your problem sets:

<ul class="org-ul">
<li>Problem set A  <a href="./prob-A.html">./prob-A.html</a></li>
</ul></li>
</ol>


<ul class="org-ul">
<li>Problem set B  <a href="./prob-B.html">./prob-B.html</a></li>
</ul>


<ol class="org-ol">
<li>Incremental builds :: Please read
<a href="./p-description.html">Description of how to do incremental builds</a>  to speed
up your build process!</li>
</ol>
</div>
</div>



<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Good Luck!</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-27 Thu]</span></span></p>
<p class="author">Author: ITWS2 Instructors VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 07:52</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
